#+title: Vary Fan Out

* Kendryte K230
#+PLOT: title:"K230 | Varied Fan-out, 256+256 Network, Fan-out 50%, 25% activity"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]"
#+PLOT: set:"xlabel 'Input Neuron Fan-out'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:256]"
#+PLOT: labels:("x" "risp" "vrisp" "vrisp-full")
|-         |      |       |            |
| N+N Size |         risp |        vrisp |   vrisp-full |
|----------+--------------+--------------+--------------|
|        / |            < |            < |            < |
|        1 | 19587.794454 | 24442.766041 | 25402.115488 |
|        2 | 15712.029916 | 24603.272235 | 26198.585276 |
|        4 | 12119.845884 | 23448.693087 | 25685.019469 |
|        8 |  6576.074662 | 20254.190086 | 25273.267202 |
|       16 |  3366.304037 | 16371.971185 | 25381.870238 |
|       32 |  1628.326896 | 11232.812393 | 20473.217960 |
|       64 |   849.972321 |  6726.256818 | 14888.795586 |
|      128 |   466.391915 |  3841.670912 |  9865.162953 |
|      256 |   229.502553 |  1919.206769 |  4976.961645 |
|----------+--------------+--------------+--------------|

* Desktop Intel i5-12400F
#+PLOT: title:"Desktop | Varied Fan-out, Network 256+256, 25% activity"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]"
#+PLOT: set:"xlabel 'Neuron Fan-out'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:256]"
#+PLOT: labels:("x" "risp" "superneuro" "vrisp")
- 256 Input Neurons, 256 Output Neurons, 0 Hidden Neurons, Varied Fan-out
- Fan-out describes how many output neurons each input is connected to
#+ATTR_HTML: :align center
#+CAPTION: Simulation time steps per second
|---------+-----------+-----------+--------------+------------------|
| Fan-out |      risp |     vrisp |   superneuro | vrisp/superneuro |
|---------+-----------+-----------+--------------+------------------|
|       / |         < |         < |            < |                < |
|       1 | 295665.54 | 303269.24 |      1228.92 |                x |
|       2 | 240749.21 | 266375.42 |       245.72 |        1084.0608 |
|       4 | 164956.61 | 265259.02 |        83.76 |        3166.8937 |
|       8 | 132138.79 | 261328.59 |        24.28 |        10763.121 |
|      16 |  95975.73 | 222340.80 |         6.38 |        34849.655 |
|      32 |  62400.54 | 151494.49 |         1.56 |        97111.853 |
|      64 |  35580.73 |  83102.03 | Failed (OOM) |              inf |
|     128 |  17448.80 |  53350.40 | Failed (OOM) |              inf |
|     256 |   8746.69 |  30995.64 | Failed (OOM) |              inf |
|---------+-----------+-----------+--------------+------------------|
#+TBLFM: @4$5=($3/$4)::@5$5=($3/$4)::@6$5=($3/$4)::@7$5=($3/$4)::@8$5=($3/$4)
